
struct About_window : Window
{
	Label lAbout;

	About_window()
	{
		init(L"Описание", 800, 600, [](HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam, Args args)
			{
				About_window* window = (About_window*)args[0];

				return DefWindowProc(hwnd, msg, wParam, lParam);
			}, DEF_WINDOW);

		lAbout.init(getHWND(), L""
			"Описание\n" 
			""
			"1)Для того чтобы ввести матрицу необходимо заполнить поля 'Переменные' и 'Ограничения'"
			"натуральными числами до 16 включительно\n"
			"Числа с плавающей точкой вводить с точкой(0.4), а дроби через / (1/5) или целое число (5)\n\n"
			""
			"2) Далее выберите параметры решения:\n"
			"     1) Метод решения (Симплекс или Искуственный базис)\n"
			"     2) Тип целевой функции (мин, макс)\n"
			"     3) Тип входных чисел\n\n"
			""
			"3) Нажмите кнопку решить\n\n"
			""
			"4) После этого появится окно решения метода который был выбран.\n"
			" Для того чтобы выполнить следующий шаг нажмите кнопку Следующий.\n"
			" Для того чтобы вернуться на предыдущий шаг нажмите кнопку Предыдущий.\n"
			" Для того чтобы решение завершилось автоматически нажмите кнопку Авто.\n"
			" Для того чтобы выбрать опорный элемент нажмите на Комбо бокс, и выберите нужный,"
			" там представлены все возможные варианты.\n\n"
			""
			"5) Алгоритм заканчивает свою работу когда больше нет опорных елементов\n\n"
			""
			"6) В симплекс методе при вводе некоректного базиса, он будет вычислен автоматически\n\n"
			""
			"7) Ввод/Вывод\n"
			"  Для того чтобы данные сохранить в файл нажмите на меню Файл и сохранить, "
			"  в директории с программой появиться файл с текущей датой и временем\n"
			"  Чтобы открыть файл нужно нажать на меню Файл открыть и выбрать нужный файл\n"
			"", 0, 0.0f, 0.0f, 1.0f, 1.0f, RESIZABLE);

		set_font_size(lAbout.handle, 20);
	}
};